[
    {
        "name": "Pack Romantique",
        "color": "romantico",
        "description": "Sensualité, ambiance et connexion intime",
        "emoji": "❤️",
        "categories": [
            {
                "name": "Sensualité et Ambiance",
                "questions": [
                    "Parties génitales épilées.",
                    "Faire l'amour avec les deux corps huilés.",
                    "Faire l'amour à la lueur des bougies.",
                    "Bain ou douche romantique à deux.",
                    "Être surpris(e) avec de la lingerie sexy.",
                    "Nuit intime dans un motel/hôtel.",
                    "Sexe avec une musique douce/sensuelle en fond.",
                    "Chantilly (ou alternative comestible) sur le corps.",
                    "Essayer des bandeaux en soie ou la privation sensorielle.",
                    "Massages des pieds comme préliminaires.",
                    "Essayer le massage Yoni/Lingam (tantrique).",
                    "Essayer l'aromathérapie pendant le sexe (huiles essentielles, encens).",
                    "Créer une 'playlist intime' commune avec vos chansons préférées.",
                    "Faire l'amour pendant un orage (bruit de pluie en fond)."
                ]
            },
            {
                "name": "Rythme et Intensité",
                "questions": [
                    "Baisers prolongés dans le cou.",
                    "Séduction lente et prolongée.",
                    "Être déshabillé(e) lentement et avec des caresses.",
                    "Sexe lent et profondément connecté (pas axé sur la rapidité).",
                    "Se réveiller avec des caresses sexuelles douces.",
                    "Quickies quand il n'y a pas de temps pour plus.",
                    "Relations sexuelles avec un peu d'agressivité et de force.",
                    "Morsures et griffures consensuelles.",
                    "Avoir des relations sexuelles de façon spontanée et inattendue.",
                    "Explorer de nouvelles positions du Kamasutra ou techniques sexuelles.",
                    "Essayer le sexe tantrique (respiration synchronisée, eye gazing).",
                    "Prolonger les préliminaires plus de 30 minutes sans pénétration.",
                    "Réveiller son/sa partenaire avec des baisers sur le corps (non génitaux)."
                ]
            },
            {
                "name": "Communication, Partage et Affection",
                "questions": [
                    "Mots tendres et affectueux pendant le sexe.",
                    "Chuchoter des secrets érotiques pendant le sexe.",
                    "Envoyer/Recevoir une lettre d'amour érotique.",
                    "Utiliser un sex toy discrètement en public (ex. plug anal ou vibrateur télécommandé).",
                    "Enregistrer des moments intimes juste pour vous (audio).",
                    "Enregistrer des moments intimes juste pour vous (photos/vidéos).",
                    "Planifier et organiser en détail un rendez-vous intime.",
                    "Regarder un film ou une série érotique/sensuelle ensemble.",
                    "Lire un forum ou livre sur le sexe (ex. Reddit, guides).",
                    "Réveiller son/sa partenaire avec un sexe oral.",
                    "Être réveillé(e) avec un sexe oral.",
                    "Sexe par téléphone ou appel vidéo.",
                    "Fondue au chocolat, nus.",
                    "Discuter de ce qu'on aime dans la pornographie.",
                    "Penser à une autre personne pendant le sexe (consenti par le couple).",
                    "Regarder de la pornographie ensemble avant le sexe.",
                    "Faire l'amour au lever ou coucher du soleil.",
                    "Échanger des fantasmes sexuels par écrit (messages).",
                    "Envoyer/recevoir des photos sensuelles ou nudes pendant la journée.",
                    "Écrire une 'bucket list sexuelle' ensemble (liste de souhaits).",
                    "Partager quel a été le moment sexuel le plus mémorable du couple.",
                    "Offrir un cadeau érotique surprise à son/sa partenaire.",
                    "Recevoir un cadeau érotique surprise de son/sa partenaire."
                ]
            }
        ]
    },
    {
        "name": "Exploration et Aventure à Deux",
        "color": "experiencia",
        "description": "Scénarios, audace et nouvelles expériences",
        "emoji": "🔥",
        "categories": [
            {
                "name": "Scénario, Exhibitionnisme et Audace",
                "questions": [
                    "Sexe dans toutes les pièces de la maison.",
                    "Sexe en plein air (plage, forêt, ruelle, etc.).",
                    "Sexe dans des endroits risqués (ascenseur, voiture, toilettes publiques).",
                    "Douche érotique à deux.",
                    "Faire un striptease l'un pour l'autre.",
                    "Essayer de la lingerie et photographier.",
                    "Sexe devant un grand miroir.",
                    "Diffuser du sexe sur une plateforme en ligne (ex. cam4 ou chaturbate).",
                    "Défi de 7 expériences en 7 jours (ou période similaire).",
                    "Porter les vêtements ou accessoires de son/sa partenaire pendant le sexe.",
                    "Faire l'amour dans une tente pendant un camping.",
                    "Sexe sur un balcon/terrasse privé (avec vue).",
                    "Essayer le sexe dans la piscine ou le jacuzzi.",
                    "Faire l'amour dans un endroit différent chaque mois (défi 12 mois)."
                ]
            },
            {
                "name": "Outils, Intensité et Rituels",
                "questions": [
                    "Acheter un jouet sexuel pour utiliser ensemble.",
                    "Utiliser un jouet télécommandé discrètement, en présence de tiers (famille, amis).",
                    "Bondage léger avec des draps ou des cravates.",
                    "Utiliser le body painting (peindre le corps).",
                    "Utiliser un code/mot pour initier le sexe immédiatement.",
                    "Essayer une nouvelle position par semaine.",
                    "Sexe oral dans des endroits inattendus.",
                    "Jouer à Action ou Vérité.",
                    "Échange de rôles de dominance et soumission pendant l'acte.",
                    "Établir un 'jour du sexe' hebdomadaire fixe (routine intime).",
                    "Embrasser son/sa partenaire avec un bonbon/chewing-gum menthe dans la bouche.",
                    "Essayer un 'sex jar' (bocal avec des idées écrites).",
                    "Faire une 'sex week' thématique (ex: semaine de l'oral, semaine du roleplay)."
                ]
            },
            {
                "name": "Communication, Fantasme et Contexte",
                "questions": [
                    "Roleplay d'inconnus dans un bar.",
                    "Voir du sexe en direct (Eros Porto, par ex.).",
                    "Voyage/vacances axés sur le plaisir et l'intimité.",
                    "Elle aller dans un espace public avec peu de vêtements ou de façon audacieuse.",
                    "Parler ouvertement des fantasmes sexuels secrets.",
                    "Visiter un sauna mixte ensemble.",
                    "Aller dans un cinéma +18 à deux.",
                    "Essayer le naturisme sur une plage ou resort.",
                    "Parler ouvertement de vos expériences sexuelles passées.",
                    "Sexting pendant la journée (messages coquins).",
                    "Teabag (oral sur les testicules).",
                    "Utiliser un plug anal pendant le sexe.",
                    "Son/Sa partenaire utiliser un plug anal pendant le sexe.",
                    "Regarder de la pornographie gay ensemble.",
                    "Double pénétration avec des jouets.",
                    "Fantasmer sur la double ou triple pénétration (sans concrétiser).",
                    "Essayer différents lubrifiants (chauffants, refroidissants, parfumés).",
                    "Sexe sous l'eau (baignoire, piscine).",
                    "Créer un 'menu sexuel' et choisir à tour de rôle.",
                    "Essayer les poppers.",
                    "Faire un dîner sensuel à deux (nu ou semi-nu).",
                    "Visiter un sex shop ensemble et choisir quelque chose de nouveau.",
                    "Créer un 'contrat intime' avec des règles et désirs mutuels."
                ]
            }
        ]
    },
    {
        "name": "Pimenté",
        "color": "pimentinha",
        "description": "Ajoutez du piquant, de la provocation et des jeux sensuels",
        "emoji": "🌶️",
        "categories": [
            {
                "name": "Intensité Sensorielle et BDSM Léger",
                "questions": [
                    "Utiliser des menottes pendant le sexe.",
                    "Être dominé(e) de façon légère.",
                    "Dominer son/sa partenaire de façon légère.",
                    "Utiliser un vibrateur/autre ensemble (simultanément).",
                    "Jouer avec un vibrateur télécommandé dans des lieux publics animés (centre commercial, restaurant).",
                    "Sexe avec un bandeau sur les yeux et des surprises tactiles.",
                    "Petits pincements, tirages de cheveux ou morsures contrôlées.",
                    "Essayer le spanking léger.",
                    "Essayer les plugs anaux.",
                    "Demander ou recevoir du praise/degradation (compliments ou humiliation verbale légère).",
                    "Utiliser des plumes ou objets doux pour le tease sensoriel.",
                    "Essayer les nipple suckers (ventouses pour mamelons).",
                    "Utiliser une corde en soie/satin pour des attaches légères."
                ]
            },
            {
                "name": "Risque, Exhibitionnisme et Transgression",
                "questions": [
                    "Sexe debout contre le mur (à la maison ou dans un endroit discret).",
                    "Provocation publique discrète (toucher audacieux).",
                    "Sexe dans la voiture dans un endroit discret.",
                    "Sexe rapide dans des endroits inattendus (sans planification).",
                    "Sexe sous la pluie ou mauvais temps.",
                    "Être 'surpris(e)' pendant le sexe.",
                    "Regarder son/sa partenaire se masturber.",
                    "Créer une playlist de podcasts érotiques à écouter/lire pendant la journée.",
                    "Échanger des nudes (photos ou vidéos) par téléphone.",
                    "Sexe sous l'effet de stupéfiants (avec sécurité et modération).",
                    "Faire l'amour avec la fenêtre/rideau ouvert (avec intimité partielle).",
                    "Sexe oral dans un lieu semi-public (ex: plage la nuit, parc vide).",
                    "Prendre un selfie intime dans un lieu public (en faisant attention à ne pas être vu par des inconnus)."
                ]
            },
            {
                "name": "Pratiques Orales Avancées",
                "questions": [
                    "Sexe oral dans la voiture en mouvement.",
                    "Sexe oral comme activité principale (sans pénétration).",
                    "Facesitting (s'asseoir sur le visage de son/sa partenaire).",
                    "Throatfucking (oral profond/gorge profonde).",
                    "Éjaculer sur le visage.",
                    "Avaler le sperme.",
                    "Essayer le ice play pendant le sexe oral (glace dans la bouche).",
                    "69 avec vibrateur simultané."
                ]
            },
            {
                "name": "Exploration Anale",
                "questions": [
                    "Anulingus (avec hygiène appropriée).",
                    "Stimuler l'anus de son/sa partenaire (externe, sans pénétration).",
                    "Recevoir une stimulation anale externe (sans pénétration).",
                    "Pénétration anale avec les doigts à son/sa partenaire.",
                    "Recevoir une pénétration anale avec les doigts.",
                    "Pegging (sexe avec strap-on).",
                    "Utiliser un vibrateur prostatique.",
                    "Essayer le fisting superficiel et consensuel.",
                    "Utiliser des anal beads (boules anales) pendant le sexe.",
                    "Massage prostatique externe (périnée) pendant l'oral."
                ]
            },
            {
                "name": "Communication et Fantasmes Intenses",
                "questions": [
                    "Dirty talk doux/piquant.",
                    "Dirty talk intense (degradation).",
                    "Cuckqueaning/cuckolding light (fantasmer, sans concrétiser).",
                    "Masturbation mutuelle prolongée.",
                    "Utiliser un bâillon (gag) pendant le sexe.",
                    "Mettre en vente des sous-vêtements sur une plateforme en ligne."
                ]
            }
        ]
    },
    {
        "name": "Polyamour",
        "color": "poliamor",
        "description": "Ouverture, non-monogamie et exploration multiple",
        "emoji": "💞",
        "categories": [
            {
                "name": "Voyeurisme et Exhibitionnisme",
                "questions": [
                    "Fantasme de plan à trois ou sexe en groupe. (Sans concrétiser)",
                    "Que son/sa partenaire ait le fantasme de plan à trois ou sexe en groupe.",
                    "Regarder son/sa partenaire embrasser une autre personne.",
                    "Être regardé(e) par son/sa partenaire en embrassant une autre personne.",
                    "Regarder son/sa partenaire recevoir du plaisir sexuel d'un(e) autre.",
                    "Recevoir du plaisir sexuel d'un(e) autre, en étant regardé(e) par son/sa partenaire.",
                    "Partager des détails intimes de votre relation avec un(e) ami(e) de confiance.",
                    "Fantasmer sur son/sa partenaire étant complimenté(e) par des tiers sur sa sexualité.",
                    "Fantasmer sur du sexe interracial.",
                    "Fantasmer avec une personne 20+ ans plus âgée.",
                    "Partager une vidéo sexting de nous avec une autre personne ou couple.",
                    "Regarder son/sa partenaire se préparer pour un rendez-vous externe.",
                    "Être vu(e) par son/sa partenaire en se préparant pour un rendez-vous externe.",
                    "M'impliquer avec quelqu'un du même sexe.",
                    "Que son/sa partenaire s'implique avec quelqu'un du même sexe.",
                    "Être dragué(e) par des tiers devant son/sa partenaire.",
                    "Que son/sa partenaire soit dragué(e) par des tiers devant moi.",
                    "Regarder des vidéos éducatives sur le polyamour et le swing ensemble.",
                    "Partager des fantasmes de polyamour dans des conversations intimes (sans concrétiser)."
                ]
            },
            {
                "name": "Risque, Exposition et Action",
                "questions": [
                    "Avoir des rencontres sexuelles avec des tiers de façon planifiée et consentie.",
                    "Que son/sa partenaire ait des rencontres sexuelles avec des tiers de façon planifiée et consentie.",
                    "Findom - fétiche où le/la partenaire dépense de l'argent pour des rendez-vous avec des tiers.",
                    "Sugar (Daddy ou Mummy) - fétiche de gagner de l'argent lors de rendez-vous avec des tiers.",
                    "Avoir un(e) partenaire fixe pour mes besoins sexuels (séparé).",
                    "Que son/sa partenaire ait un(e) partenaire fixe pour ses besoins sexuels (séparé).",
                    "Aller dans un bar/discothèque échangiste ou à une fête, juste pour observer.",
                    "Aller dans un bar échangiste ou fête avec l'objectif de participer activement.",
                    "Fréquenter des saunas mixtes ou lieux de cruising (comme les gloryholes).",
                    "Aller dans un bar/discothèque avec son/sa partenaire comme célibataires et rencontrer de nouvelles personnes, avec des règles définies.",
                    "S'impliquer avec son/sa partenaire dans du sexe avec plus de quatre personnes (Orgies/grandes fêtes).",
                    "Dogging Actif: Avoir du sexe dans des lieux publics (voitures, parcs) avec des observateurs connus/inconnus.",
                    "Payer pour du sexe (prostituées) avec le consentement de son/sa partenaire.",
                    "Que son/sa partenaire paie pour du sexe, avec mon consentement.",
                    "Faire un massage tantrique (Yoni/Lingam).",
                    "Être surpris(e) par son/sa partenaire pendant le sexe, avec l'apparition d'une tierce personne.",
                    "Surprendre son/sa partenaire pendant le sexe, avec l'apparition d'une tierce personne.",
                    "Échanger des sous-vêtements avec des tiers.",
                    "Discuter avec d'autres couples d'expériences d'ouverture de relation.",
                    "Lire des histoires/témoignages réels sur des expériences polyamoureuses ensemble."
                ]
            },
            {
                "name": "Structure, Limites et Affection",
                "questions": [
                    "Un(e) amant(e) en commun pour le couple (Unicorn Hunting).",
                    "Partenaire fixe pour moi uniquement pour le sexe (avec règles et limites).",
                    "Partenaire fixe pour mon/ma partenaire uniquement pour le sexe (avec règles et limites).",
                    "Implication sexuelle du/de la partenaire avec des personnes du même genre que lui/elle (bisexualité).",
                    "Rendez-vous avec un autre couple (voir si ça matche) - axé sur la socialisation.",
                    "Expériences polyamoureuses à l'étranger (comme test ou aventure).",
                    "Discussion honnête sur la jalousie avant tout engagement.",
                    "Créer un profil de couple sur des apps/sites échangistes ou de rencontres.",
                    "Inviter un couple pour une rencontre intime (naturisme, par ex).",
                    "Plan à trois avec un autre homme (MMF).",
                    "Plan à trois avec une autre femme (FFM).",
                    "Soft Swing (seulement baisers et caresses avec un autre couple, sans pénétration).",
                    "Sexe monogame avec d'autres couples présents (chaque couple entre eux).",
                    "Hard Swing: À quatre, avec échange complet entre couples.",
                    "Regarder son/sa partenaire recevoir de l'oral d'un(e) tiers.",
                    "Donner de l'oral à un(e) tiers pendant que son/sa partenaire regarde.",
                    "Discuter des limites et règles avant toute expérience avec des tiers.",
                    "Parler des jalousies et insécurités avant d'explorer.",
                    "Définir un 'aftercare plan' (soins post-expérience) avant d'explorer."
                ]
            }
        ]
    },
    {
        "name": "Fétiches",
        "color": "kinks",
        "description": "Fétiches spécifiques, pratiques avancées et kinks",
        "emoji": "🎭",
        "categories": [
            {
                "name": "Dynamiques de Pouvoir (D/S - Dominance et Soumission)",
                "questions": [
                    "Être la personne dominante dans la relation sexuelle.",
                    "Être la personne soumise dans la relation sexuelle.",
                    "Avoir le contrôle total du rythme et des actions de son/sa partenaire (commandement/instructions).",
                    "Me rendre totalement à mon/ma partenaire, suivant toutes les instructions et ordres (soumission totale).",
                    "Utiliser ou recevoir un collier ou d'autres symboles de possession et de soumission.",
                    "Faire attendre et supplier son/sa partenaire pour le plaisir.",
                    "Donner du praise ou degradation (compliments ou humiliation verbale légère) à son/sa partenaire.",
                    "Recevoir du praise ou degradation (compliments ou humiliation verbale légère) de son/sa partenaire.",
                    "Bander les yeux de son/sa partenaire pour la privation sensorielle.",
                    "Être les yeux bandés pour la privation sensorielle.",
                    "Attribuer des tâches (ménage, etc.) dans le cadre d'un jeu D/S.",
                    "Effectuer des tâches (ménage, etc.) attribuées par son/sa partenaire dans le cadre d'un jeu D/S.",
                    "Utiliser des fouets/palettes (flogger, paddle) de façon contrôlée.",
                    "Recevoir des coups de fouet/fessées (flogger, paddle) de façon contrôlée.",
                    "Viol consenti non planifié (avec safe word)."
                ]
            },
            {
                "name": "BDSM Physique et Bondage",
                "questions": [
                    "Attaches/bondages élaborés (shibari, cordes).",
                    "Immobilisation totale avec des chaînes, menottes ou cuffs.",
                    "Restriction de mouvements pendant de longues périodes (plus de 30 minutes).",
                    "Gagging (bâillonner) et/ou muzzling (muselières).",
                    "Respiration contrôlée (breath play) et restriction d'oxygène.",
                    "Spanking (fessées) intenses au point de laisser des marques.",
                    "Impact play (impact) utilisant la main ou des ustensiles (paddle, canne).",
                    "Nipple clamps (pinces à mamelons) ou clips pour la pression.",
                    "Jouer avec de la cire chaude (wax play) sur le corps de son/sa partenaire.",
                    "Recevoir de la cire chaude (wax play) sur le corps.",
                    "Jouer avec de la glace ou des températures froides sur le corps de son/sa partenaire.",
                    "Électrostimulation pour des fins sexuelles.",
                    "Être craché(e) dessus ou cracher sur son/sa partenaire.",
                    "Étranglement agressif (choking contrôlé) au niveau du cou.",
                    "Tirer les cheveux avec force pendant le sexe.",
                    "Edge play (mener à l'orgasme et s'arrêter répétitivement).",
                    "Tease and denial (provoquer et refuser l'orgasme) à son/sa partenaire.",
                    "Tease and denial (provoquer et refuser l'orgasme) de son/sa partenaire."
                ]
            },
            {
                "name": "Fétiches de Rôle et Scénario (Roleplay/Fantasy)",
                "questions": [
                    "Roleplay de Médecin et Patient(e).",
                    "Roleplay de Professeur(e) et Élève.",
                    "Roleplay de Police/Gardiens et Prisonnier(ère).",
                    "Roleplay avec des scénarios de pouvoir/patron/secrétaire.",
                    "Age play (jouer avec les différences d'âge, ex: daddy/mommy).",
                    "Furry (fantasmes avec des déguisements d'animaux) ou pet play (jouer à l'animal de compagnie).",
                    "Diaper play (port de couches, comportement infantile).",
                    "M'habiller avec les sous-vêtements de mon/ma partenaire (cross-dressing léger).",
                    "Hypnose (hypnose érotique).",
                    "Simuler un enlèvement (kidnapping roleplay).",
                    "Avoir du sexe en public mais être surpris (exhibitionnisme avec risque).",
                    "Être observé(e) par son/sa partenaire pendant que je me masturbe.",
                    "Espionner son/sa partenaire se masturber ou dans des moments intimes avec des tiers (voyeurisme passif).",
                    "Sexe avec des masques ou anonymat."
                ]
            },
            {
                "name": "Fétiches de Matériaux et Vêtements",
                "questions": [
                    "Latex/caoutchouc (rubber fetishism).",
                    "Cuir (leather).",
                    "Porter du spandex, lycra ou vêtements de sport dans des contextes érotiques.",
                    "Uniformes (militaire, infirmière, etc.).",
                    "Vêtements d'époque (corsets, style victorien).",
                    "Bas résille, fishnets ou bas hauts (stockings).",
                    "Chaussures à talons hauts ou bottes dans des scénarios sexuels.",
                    "Costumes de super-héros ou personnages de bande dessinée.",
                    "Tatouages et piercings comme facteur d'attraction sexuelle.",
                    "Masking (port de masques à gaz, cagoules, etc.).",
                    "Clés et cadenas (chasteté ou symboles de possession).",
                    "Transparences (sheer fabric) ou vêtements qui révèlent beaucoup.",
                    "Gants de différents matériaux (cuir, latex, etc.).",
                    "Lunettes ou accessoires intellectuels dans des contextes érotiques."
                ]
            },
            {
                "name": "Fétiches de Fluides et Biologie",
                "questions": [
                    "Urine (urophilie ou golden shower).",
                    "Selles (scat ou coprophilie).",
                    "Lait maternel (lactation fetish).",
                    "Sang (vampirisme / hématolagnie) dans des scénarios de jeu (non violent).",
                    "Se faire éclabousser par le sperme/éjaculation.",
                    "Manger ou boire des fluides corporels (autre que salive et sperme).",
                    "Sueur et odeurs corporelles fortes de son/sa partenaire.",
                    "Sexe pendant les règles (avec hygiène).",
                    "Écouter son/sa partenaire gémir ou faire des bruits forts (narratophilie).",
                    "Spasmes musculaires ou contractions pendant l'orgasme.",
                    "Farting (fétichisme des flatulences).",
                    "Poils corporels (barbe, aisselles, pubiens, etc.) abondants et non épilés."
                ]
            },
            {
                "name": "Fétiches de Parties du Corps et Sensoriels",
                "questions": [
                    "Pieds (foot fetishism).",
                    "Sentir ou lécher les chaussures/chaussettes/baskets de son/sa partenaire.",
                    "Aisselles.",
                    "Mains et doigts (hand fetishism).",
                    "Fesses.",
                    "Oreilles (otolagnie).",
                    "Ventres/nombrils (belly fetishism / navel fetishism).",
                    "Seins/mamelons (breast fetishism).",
                    "Cheveux longs (hair fetishism).",
                    "Personnes grandes (macrophilie).",
                    "Personnes en surpoids (fat fetishism).",
                    "Trampling (piétiner avec les pieds/corps) son/sa partenaire.",
                    "Être piétiné(e) (trampling) par son/sa partenaire.",
                    "Être écrasé(e) (crush) par le corps de son/sa partenaire (poids total).",
                    "Tatouages corporels/cicatrices (scarification fetish).",
                    "Nettoyer les parties génitales de son/sa partenaire (préparation).",
                    "Tickle torture (chatouilles intenses à des fins érotiques)."
                ]
            }
        ]
    }
]
