[
    {
        "name": "Pack Romántico",
        "color": "romantico",
        "description": "Sensualidad, ambiente y conexión íntima",
        "emoji": "❤️",
        "categories": [
            {
                "name": "Sensualidad y Ambiente",
                "questions": [
                    "Genitales depilados.",
                    "Hacer el amor con ambos cuerpos aceitados.",
                    "Hacer el amor a la luz de las velas.",
                    "Baño o ducha romántica en pareja.",
                    "Ser sorprendido/a con lencería sexy.",
                    "Noche íntima en un motel/hotel.",
                    "Sexo con música suave/sensual de fondo.",
                    "Nata montada (o alternativa comestible) por el cuerpo.",
                    "Probar vendas de seda o privación sensorial.",
                    "Masajes en los pies como preliminar.",
                    "Probar masaje Yoni/Lingam (tántrico).",
                    "Probar aromaterapia durante el sexo (aceites esenciales, inciensos).",
                    "Crear una 'playlist íntima' conjunta con vuestras canciones favoritas.",
                    "Hacer el amor durante una tormenta (sonido de lluvia de fondo)."
                ]
            },
            {
                "name": "Ritmo e Intensidad",
                "questions": [
                    "Besos prolongados en el cuello.",
                    "Seducción lenta y prolongada.",
                    "Ser desnudado/a lentamente y con caricias.",
                    "Sexo lento y profundamente conectado (no centrado en la rapidez).",
                    "Despertar con caricias sexuales suaves.",
                    "Rapiditos cuando no hay tiempo para más.",
                    "Relaciones sexuales con algo de agresividad y fuerza.",
                    "Mordiscos y arañazos consensuados.",
                    "Tener relaciones sexuales de forma espontánea e inesperada.",
                    "Explorar posiciones nuevas del Kamasutra o técnicas sexuales.",
                    "Probar sexo tántrico (respiración sincronizada, eye gazing).",
                    "Prolongar los preliminares más de 30 minutos sin penetración.",
                    "Despertar a tu pareja con besos por el cuerpo (no genitales)."
                ]
            },
            {
                "name": "Comunicación, Compartir y Afecto",
                "questions": [
                    "Palabras de cariño y afecto durante el sexo.",
                    "Susurrar secretos eróticos durante el sexo.",
                    "Enviar/Recibir una carta de amor erótica.",
                    "Usar juguete sexual discretamente en público (ej. plug anal o vibrador remoto).",
                    "Grabar momentos íntimos solo para vosotros (audio).",
                    "Grabar momentos íntimos solo para vosotros (fotos/vídeos).",
                    "Programar y planear al detalle un encuentro íntimo.",
                    "Ver una película o serie erótica/sensual juntos.",
                    "Leer un foro o libro sobre sexo (ej. Reddit, guías).",
                    "Despertar a tu pareja con sexo oral.",
                    "Ser despertado/a con sexo oral.",
                    "Sexo por teléfono o videollamada.",
                    "Fondue de chocolate, desnudos.",
                    "Hablar sobre lo que nos gusta de la pornografía.",
                    "Pensar en otra persona durante el sexo (consentido por la pareja).",
                    "Ver pornografía juntos antes del sexo.",
                    "Hacer el amor al amanecer o atardecer.",
                    "Intercambiar fantasías sexuales por escrito (mensajes).",
                    "Enviar/recibir fotos sensuales o nudes durante el día.",
                    "Escribir una 'bucket list sexual' juntos (lista de deseos).",
                    "Compartir cuál fue el momento sexual más memorable de la pareja.",
                    "Dar un regalo erótico sorpresa a tu pareja.",
                    "Recibir un regalo erótico sorpresa de tu pareja."
                ]
            }
        ]
    },
    {
        "name": "Exploración y Aventura en Pareja",
        "color": "experiencia",
        "description": "Escenarios, atrevimiento y nuevas experiencias",
        "emoji": "🔥",
        "categories": [
            {
                "name": "Escenario, Exhibicionismo y Atrevimiento",
                "questions": [
                    "Sexo en todas las habitaciones de la casa.",
                    "Sexo al aire libre (playa, bosque, callejón, etc.).",
                    "Sexo en lugares arriesgados (ascensor, coche, baño público).",
                    "Ducha erótica en pareja.",
                    "Hacer striptease el uno para el otro.",
                    "Probar lencería y fotografiar.",
                    "Sexo frente a un espejo grande.",
                    "Transmitir sexo en plataforma online (ej. cam4 o chaturbate).",
                    "Desafío de 7 experiencias en 7 días (o período similar).",
                    "Usar la ropa o accesorios de la pareja durante el sexo.",
                    "Hacer el amor en una tienda durante un camping.",
                    "Sexo en un balcón/terraza privado (con vistas).",
                    "Probar sexo en la piscina o jacuzzi.",
                    "Hacer el amor en un lugar diferente cada mes (desafío 12 meses)."
                ]
            },
            {
                "name": "Herramientas, Intensidad y Rituales",
                "questions": [
                    "Comprar un juguete sexual para usar juntos.",
                    "Usar juguete con control remoto discretamente, en presencia de terceros (familiares, amigos).",
                    "Bondage suave con sábanas o corbatas.",
                    "Usar body painting (pintar el cuerpo).",
                    "Usar un código/palabra para iniciar sexo de inmediato.",
                    "Probar una posición nueva por semana.",
                    "Sexo oral en lugares inesperados.",
                    "Jugar a Verdad o Reto.",
                    "Intercambio de roles de dominancia y sumisión durante el acto.",
                    "Establecer un 'día del sexo' semanal fijo (rutina íntima).",
                    "Besar a tu pareja con un chicle/caramelo de mentol en la boca.",
                    "Probar un 'sex jar' (tarro con ideas escritas).",
                    "Hacer una 'sex week' temática (ej: semana del oral, semana del roleplay)."
                ]
            },
            {
                "name": "Comunicación, Fantasía y Contexto",
                "questions": [
                    "Roleplay de desconocidos en un bar.",
                    "Ver sexo en vivo (Eros Porto, por ej.).",
                    "Viaje/vacaciones enfocadas en placer e intimidad.",
                    "Ella ir a un espacio público con poca ropa o de forma atrevida.",
                    "Hablar abiertamente sobre fantasías sexuales secretas.",
                    "Visitar una sauna mixta juntos.",
                    "Ir a un cine +18 en pareja.",
                    "Probar nudismo en una playa o resort.",
                    "Hablar abiertamente sobre vuestras experiencias sexuales anteriores.",
                    "Sexting durante el día (mensajes picantes).",
                    "Teabag (oral en los testículos).",
                    "Usar un butt plug durante el sexo.",
                    "Tu pareja usar butt plug durante el sexo.",
                    "Ver pornografía gay juntos.",
                    "Doble penetración con juguetes.",
                    "Fantasear con doble o triple penetración (sin concretar).",
                    "Probar diferentes lubricantes (calentamiento, enfriamiento, sabores).",
                    "Sexo bajo el agua (bañera, piscina).",
                    "Crear un 'menú sexual' y elegir por turnos.",
                    "Probar poppers.",
                    "Hacer una cena sensual en pareja (desnudos o semidesnudos).",
                    "Visitar un sex shop juntos y elegir algo nuevo.",
                    "Crear un 'contrato íntimo' con reglas y deseos mutuos."
                ]
            }
        ]
    },
    {
        "name": "Picante",
        "color": "pimentinha",
        "description": "Añade sazón, provocación y juegos sensuales",
        "emoji": "🌶️",
        "categories": [
            {
                "name": "Intensidad Sensorial y BDSM Suave",
                "questions": [
                    "Usar esposas durante el sexo.",
                    "Ser dominado/a de forma suave.",
                    "Dominar a tu pareja de forma suave.",
                    "Usar vibrador/otro juntos (simultáneamente).",
                    "Jugar con un vibrador de control remoto en lugares públicos concurridos (centro comercial, restaurante).",
                    "Sexo con venda en los ojos y sorpresas táctiles.",
                    "Pequeños pellizcos, tirones de pelo o mordiscos controlados.",
                    "Probar spanking suave.",
                    "Probar plugs anales.",
                    "Pedir o recibir praise/degradation (elogios o humillación verbal leve).",
                    "Usar plumas u objetos suaves para tease sensorial.",
                    "Probar nipple suckers (succionadores de pezones).",
                    "Usar cuerda de seda/satén para ataduras suaves."
                ]
            },
            {
                "name": "Riesgo, Exhibicionismo y Transgresión",
                "questions": [
                    "Sexo de pie contra la pared (en casa o en lugar discreto).",
                    "Provocación pública discreta (toque atrevido).",
                    "Sexo en el coche en lugar discreto.",
                    "Sexo rápido en lugares inesperados (sin planificación).",
                    "Sexo bajo la lluvia o mal tiempo.",
                    "Ser 'pillado/a' durante el sexo.",
                    "Ver a tu pareja masturbarse.",
                    "Crear una playlist de podcasts eróticos para escuchar/leer durante el día.",
                    "Intercambiar nudes (fotos o vídeos) por el móvil.",
                    "Sexo bajo efectos de estupefacientes (con seguridad y moderación).",
                    "Hacer el amor con la ventana/cortina abierta (con privacidad parcial).",
                    "Sexo oral en lugar semi-público (ej: playa de noche, parque vacío).",
                    "Tomar una selfie íntima en lugar público (con cuidado de no ser visto por desconocidos)."
                ]
            },
            {
                "name": "Prácticas Orales Avanzadas",
                "questions": [
                    "Sexo oral en el coche en movimiento.",
                    "Sexo oral como actividad principal (sin penetración).",
                    "Facesitting (sentarse en la cara de tu pareja).",
                    "Throatfucking (oral profundo/garganta profunda).",
                    "Eyacular en la cara.",
                    "Tragar semen.",
                    "Probar ice play durante el sexo oral (hielo en la boca).",
                    "69 con vibrador simultáneo."
                ]
            },
            {
                "name": "Exploración Anal",
                "questions": [
                    "Beso negro (con debida higiene).",
                    "Estimular el ano de tu pareja (externo, sin penetración).",
                    "Recibir estimulación anal externa (sin penetración).",
                    "Penetración anal con dedos a tu pareja.",
                    "Recibir penetración anal con dedos.",
                    "Pegging (sexo con strap-on).",
                    "Usar vibrador de próstata.",
                    "Probar fisting superficial y consensuado.",
                    "Usar anal beads (cuentas anales) durante el sexo.",
                    "Masaje prostático externo (perineo) durante el oral."
                ]
            },
            {
                "name": "Comunicación y Fantasías Intensas",
                "questions": [
                    "Dirty talk suave/picante.",
                    "Dirty talk intenso (degradation).",
                    "Cuckqueaning/cuckolding light (fantasear, sin concretar).",
                    "Masturbación mutua prolongada.",
                    "Usar mordaza (gag) durante el sexo.",
                    "Poner a la venta ropa interior en una plataforma online."
                ]
            }
        ]
    },
    {
        "name": "Poliamor",
        "color": "poliamor",
        "description": "Apertura, no-monogamia y exploración múltiple",
        "emoji": "💞",
        "categories": [
            {
                "name": "Voyeurismo y Exhibicionismo",
                "questions": [
                    "Fantasía de trío o sexo en grupo. (Sin concretar)",
                    "Que tu pareja tenga fantasía de trío o sexo en grupo.",
                    "Ver a tu pareja besando a otra persona.",
                    "Ser visto/a por tu pareja mientras besas a otra persona.",
                    "Ver a tu pareja recibiendo placer sexual de otro/a.",
                    "Recibir placer sexual de otro/a, siendo visto/a por tu pareja.",
                    "Compartir detalles íntimos de vuestra relación con un/a amigo/a de confianza.",
                    "Fantasear sobre tu pareja siendo elogiado/a por terceros por su sexualidad.",
                    "Fantasear con sexo interracial.",
                    "Fantasear con persona 20+ años mayor.",
                    "Compartir un vídeo sexting nuestro con otra persona o pareja.",
                    "Ver a tu pareja preparándose para una cita externa.",
                    "Ser visto/a por tu pareja mientras te preparas para una cita externa.",
                    "Involucrarme con alguien del mismo sexo.",
                    "Que tu pareja se involucre con alguien del mismo sexo.",
                    "Ser coqueteado/a por terceros frente a tu pareja.",
                    "Que tu pareja sea coqueteada por terceros frente a ti.",
                    "Ver vídeos educativos sobre poliamor y swing juntos.",
                    "Compartir fantasías de poliamor en conversaciones íntimas (sin concretar)."
                ]
            },
            {
                "name": "Riesgo, Exposición y Acción",
                "questions": [
                    "Tener encuentros sexuales con terceros de forma planeada y consentida.",
                    "Que tu pareja tenga encuentros sexuales con terceros de forma planeada y consentida.",
                    "Findom - fetiche en que la pareja gaste dinero en citas con terceros.",
                    "Sugar (Daddy o Mummy) - fetiche en ganar dinero en citas con terceros.",
                    "Tener una pareja fija para mis necesidades sexuales (separado).",
                    "Que tu pareja tenga una pareja fija para sus necesidades sexuales (separado).",
                    "Ir a un bar/discoteca swing o a una fiesta, solo para observar.",
                    "Ir a un bar swing o fiesta con el objetivo de participar activamente.",
                    "Frecuentar saunas mixtas o cruising spots (como gloryholes).",
                    "Ir a un bar/discoteca con tu pareja como solteros y conocer personas nuevas, con reglas definidas.",
                    "Involucrarse con la pareja en sexo con más de cuatro personas (Orgías/fiestas grandes).",
                    "Dogging Activo: Tener sexo en lugares públicos (coches, parques) con observadores conocidos/desconocidos.",
                    "Pagar por sexo (prostitutas/os) con consentimiento de la pareja.",
                    "Que tu pareja pague por sexo, con mi consentimiento.",
                    "Hacer un masaje tántrico (Yoni/Lingam).",
                    "Ser sorprendido por tu pareja durante el sexo, con la aparición de una tercera persona.",
                    "Sorprender a tu pareja durante el sexo, con la aparición de una tercera persona.",
                    "Intercambiar ropa interior con tercero(s).",
                    "Conversar con otras parejas sobre experiencias de apertura de relación.",
                    "Leer historias/relatos reales sobre experiencias poliamorosas juntos."
                ]
            },
            {
                "name": "Estructura, Límites y Afecto",
                "questions": [
                    "Un/a amante en común para la pareja (Unicorn Hunting).",
                    "Pareja fija para mí solo para sexo (con reglas y límites).",
                    "Pareja fija para mi pareja solo para sexo (con reglas y límites).",
                    "Involucramiento sexual de la pareja con personas del mismo género de la pareja (bisexualidad).",
                    "Citas con otra pareja (ver si surge algo) - enfocado en la socialización.",
                    "Experiencias poliamorosas en el extranjero (como prueba o aventura).",
                    "Discusión honesta sobre celos antes de haber involucramiento.",
                    "Crear un perfil de pareja en apps/sites de swing o encuentros.",
                    "Invitar a una pareja para encuentro íntimo (nudismo, por ej).",
                    "Trío con otro hombre (MMF).",
                    "Trío con otra mujer (FFM).",
                    "Soft Swing (solo besos y caricias con otra pareja, sin penetración).",
                    "Sexo monogámico con otras parejas presentes (cada pareja entre sí).",
                    "Hard Swing: A cuatro, con intercambio completo entre parejas.",
                    "Ver a tu pareja recibiendo oral de un tercero/a.",
                    "Dar oral a un tercero/a mientras tu pareja observa.",
                    "Discutir límites y reglas antes de cualquier experiencia con terceros.",
                    "Conversar sobre celos e inseguridades antes de explorar.",
                    "Definir un 'aftercare plan' (cuidados post-experiencia) antes de explorar."
                ]
            }
        ]
    },
    {
        "name": "Fetiches",
        "color": "kinks",
        "description": "Fetiches específicos, prácticas avanzadas y kinks",
        "emoji": "🎭",
        "categories": [
            {
                "name": "Dinámicas de Poder (D/S - Dominancia y Sumisión)",
                "questions": [
                    "Ser la persona dominante en la relación sexual.",
                    "Ser la persona sumisa en la relación sexual.",
                    "Tener el control total del ritmo y de las acciones de tu pareja (comando/instrucciones).",
                    "Rendirme totalmente a mi pareja, siguiendo todas las instrucciones y órdenes (sumisión total).",
                    "Usar o recibir collar u otros símbolos de posesión y sumisión.",
                    "Hacer a tu pareja esperar e implorar por placer.",
                    "Dar praise o degradation (elogios o humillación verbal leve) a tu pareja.",
                    "Recibir praise o degradation (elogios o humillación verbal leve) de tu pareja.",
                    "Vendar a tu pareja para privación sensorial.",
                    "Ser vendado/a para privación sensorial.",
                    "Asignar tareas (tareas domésticas, etc.) como parte de un juego D/S.",
                    "Realizar tareas (tareas domésticas, etc.) asignadas por tu pareja como parte de un juego D/S.",
                    "Usar látigos/palmetas (flogger, paddle) de forma controlada.",
                    "Recibir latigazos/palmadas (flogger, paddle) de forma controlada.",
                    "Violación consentida no planeada (con safe word)."
                ]
            },
            {
                "name": "BDSM Físico y Bondage",
                "questions": [
                    "Ataduras/amarres elaborados (shibari, cuerdas).",
                    "Inmovilización total con cadenas, esposas o cuffs.",
                    "Restricción de movimientos por largos períodos (más de 30 minutos).",
                    "Gagging (tapar la boca) y/o muzzling (mordazas).",
                    "Respiración controlada (breath play) y restricción del oxígeno.",
                    "Spanking (palmadas) intensas al punto de dejar marca.",
                    "Impact play (impacto) usando la mano o utensilios (paddle, caña).",
                    "Nipple clamps (pinzas para pezones) o clips para presión.",
                    "Jugar con cera caliente (wax play) en el cuerpo de tu pareja.",
                    "Recibir cera caliente (wax play) en el cuerpo.",
                    "Jugar con hielo o temperaturas frías en el cuerpo de tu pareja.",
                    "Electrostimulation (electro-estimulación) para fines sexuales.",
                    "Ser escupido/a o escupir a tu pareja.",
                    "Estrangulamiento agresivo (choking controlado) en el cuello.",
                    "Tirar del pelo con fuerza durante el sexo.",
                    "Edge play (llevar al orgasmo y parar repetidamente).",
                    "Tease and denial (provocar y negar el orgasmo) a tu pareja.",
                    "Tease and denial (provocar y negar el orgasmo) de tu pareja."
                ]
            },
            {
                "name": "Fetiches de Rol y Escenario (Roleplay/Fantasy)",
                "questions": [
                    "Roleplay de Médico/a y Paciente.",
                    "Roleplay de Profesor/a y Alumno/a.",
                    "Roleplay de Policía/Guardias y Prisionero/a.",
                    "Roleplay con escenarios de poder/jefe/secretario/a.",
                    "Age play (jugar con diferencias de edad, ej: daddy/mommy).",
                    "Furry (fantasías con disfraces de animales) o pet play (jugar a ser mascota).",
                    "Diaper play (uso de pañales, comportamiento infantil).",
                    "Vestirme con la ropa íntima de mi pareja (cross-dressing leve).",
                    "Hypnosis (hipnosis erótica).",
                    "Simular secuestro (kidnapping roleplay).",
                    "Tener sexo en público pero ser pillado (exhibicionismo con riesgo).",
                    "Ser observado/a por tu pareja mientras me masturbo.",
                    "Espiar a tu pareja masturbándose o en momentos íntimos con terceros (voyeurismo pasivo).",
                    "Sexo con máscaras o anonimato."
                ]
            },
            {
                "name": "Fetiches de Materiales y Vestuario",
                "questions": [
                    "Látex/goma (rubber fetishism).",
                    "Cuero (leather).",
                    "Usar spandex, lycra o ropa deportiva en contextos eróticos.",
                    "Uniformes (militar, enfermería, etc.).",
                    "Ropa de época (corsés, espartillos, victoriano).",
                    "Medias de red, fishnets o medias altas (stockings).",
                    "Zapatos de tacón alto o botas en escenarios sexuales.",
                    "Disfraces de superhéroes o personajes de cómic.",
                    "Tatuajes y piercings como factor de atracción sexual.",
                    "Masking (uso de máscaras de gas, pasamontañas, etc.).",
                    "Llaves y candados (chastity/castidad o símbolos de posesión).",
                    "Transparencias (sheer fabric) o ropa que revele mucho.",
                    "Guantes de diferentes materiales (cuero, látex, etc.).",
                    "Gafas o accesorios intelectuales en contextos eróticos."
                ]
            },
            {
                "name": "Fetiches de Fluidos y Biología",
                "questions": [
                    "Orina (urolagnia o golden shower).",
                    "Heces (scat o coprofilia).",
                    "Leche materna (lactation fetish).",
                    "Sangre (vampirism / hematolagnia) en escenarios de juego (no violento).",
                    "Que me ensucien con semen/eyaculación.",
                    "Comer o beber fluidos corporales (sin ser saliva y semen).",
                    "Sudor y olores corporales fuertes de tu pareja.",
                    "Sexo durante la menstruación (con higiene).",
                    "Escuchar a tu pareja gemir o hacer ruidos altos (narratofilia).",
                    "Espasmos musculares o twitching durante el orgasmo.",
                    "Farting (fetiche de flatulencias).",
                    "Vello corporal (barba, axilas, púbico, etc.) abundante y sin depilar."
                ]
            },
            {
                "name": "Fetiches de Partes del Cuerpo y Sensoriales",
                "questions": [
                    "Pies (foot fetishism).",
                    "Oler o lamer zapatos/medias/zapatillas de tu pareja.",
                    "Axilas.",
                    "Manos y dedos (hand fetishism).",
                    "Nalgas/traseros.",
                    "Orejas (otolagnia).",
                    "Barrigas/ombligos (belly fetishism / navel fetishism).",
                    "Pechos/pezones (breast fetishism).",
                    "Pelo largo (hair fetishism).",
                    "Personas altas (macrofilia).",
                    "Personas con sobrepeso (fat fetishism).",
                    "Trampling (pisar con los pies/cuerpo) a tu pareja.",
                    "Ser pisado/a (trampling) por tu pareja.",
                    "Ser aplastado/a (crush) por el cuerpo de tu pareja (peso total).",
                    "Tatuajes corporales/cicatrices (scarification fetish).",
                    "Limpiar los genitales de tu pareja (preparación).",
                    "Tickle torture (hacer cosquillas intensas con fines eróticos)."
                ]
            }
        ]
    }
]
